In [1]:
import numpy as np
import pandas as pd

In [3]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

#### Dropping the NaN, None, np.nan values by using dropna() method

In [6]:
df.dropna()

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [9]:
# the dropna() methods default and it's default arguments
df.dropna(axis='index', how='any') # it drops rows which is represented by 'axis=index', how='any', any row containing at least one missing value will be dropped

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [10]:
# now passing custom arguments in dropna() method and dropping rows which has 
df.dropna(axis='index', how='all') # this will drop rows which has all the missing value, i.e row no 4 in our dataframe

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [12]:
# changing axis to columns instead of index drops column which has missing value
df.dropna(axis='columns', how='all') # we don't have any column with all missing value so the result is same as original dataframe

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [13]:
df.dropna(axis='columns', how='any') # this will return empty df, because it will drop a column if it finds any missing value on it.

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

#### dropping rows which don't have email
by using subset argument, this subset will be the column name that we are checking for missing values. If it finds any missing value in this column, then it will drop that row, not that column

In [15]:
df.dropna(axis='index', how='any', subset=['email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [14]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

#### dropping rows which doesn't have last or email
by using dropna(axis='index' how='any', subset=['last','email'])

In [16]:
df.dropna(axis='index', how='any', subset=['last', 'email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

#### replacing custom missing value with our value
by using numpy.nan value

In [17]:
df.replace('NA', np.nan, inplace = True) # replacing the string 'NA' value with numpy.nan, not a number value
df.replace('Missing', np.nan, inplace = True)
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [19]:
df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [22]:
df.isna() # checking if there are 'na' value

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

### fillna() to fill the 'na' values

In [23]:
df.fillna('MissedValue')

         first         last                    email          age
0        Corey      Schafer  CoreyMSchafer@gmail.com           33
1         Jane          Doe        JaneDoe@email.com           55
2         John          Doe        JohnDoe@email.com           63
3        Chris      Schafer              MissedValue           36
4  MissedValue  MissedValue              MissedValue  MissedValue
5  MissedValue  MissedValue      Anonymous@email.com  MissedValue
6  MissedValue  MissedValue              MissedValue  MissedValue

## Casting columns

In [26]:
df.dtypes # accessing the datatypes of the columns, age column is also string, we need to convert it to numeric value (int, float)

first    object
last     object
email    object
age      object
dtype: object

converting age column to float, because nan values are float type so converting them to integer will create issue

In [28]:
# converting age col to int, gives error
df['age'] = df['age'].astype(int)

TypeError: int() argument must be a string, a bytes-like object or a real number, not 'NoneType'

In [29]:
df['age'] = df['age'].astype(float)

In [30]:
df['age'].mean()

46.75

In [31]:
df['age'].median()

45.5

In [34]:
# we can also convert all the columns in df to a single datatype by df.astype(int) if necessary
df.astype('string')

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33.0
1   Jane      Doe        JaneDoe@email.com  55.0
2   John      Doe        JohnDoe@email.com  63.0
3  Chris  Schafer                     <NA>  36.0
4   <NA>     <NA>                     <NA>  <NA>
5   <NA>     <NA>      Anonymous@email.com  <NA>
6   <NA>     <NA>                     <NA>  <NA>

In [36]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

## Practicing in Stackoverflow Data

In [38]:
df = pd.read_csv('data/survey_results_public.csv', index_col = 'Respondent')
schema_df = pd.read_csv('data/survey_results_schema.csv', index_col = 'Column')

### Ignoring the custom values when loading csv

We simpy pass an argument of list of values that we want to be treated as missing like:
    na_values = ['NA', 'Missing']

In [47]:
na_vals = ['NA', 'Missing']
df = pd.read_csv('data/survey_results_public.csv', index_col = 'Respondent', na_values = na_vals) # replaces the values in na_vals list to nan value
schema_df = pd.read_csv('data/survey_results_schema.csv', index_col = 'Column', na_values = na_vals)

In [45]:
pd.set_option('display.max_columns', 85)
pd.set_option('display.max_rows', 85)

In [46]:
df.head(5); # ';' hides the output

### Finding average number of coding experience of the respondents
This analysis includes:
    - data casting

In [48]:
df.columns

Index(['MainBranch', 'Hobbyist', 'OpenSourcer', 'OpenSource', 'Employment',
       'Country', 'Student', 'EdLevel', 'UndergradMajor', 'EduOther',
       'OrgSize', 'DevType', 'YearsCode', 'Age1stCode', 'YearsCodePro',
       'CareerSat', 'JobSat', 'MgrIdiot', 'MgrMoney', 'MgrWant', 'JobSeek',
       'LastHireDate', 'LastInt', 'FizzBuzz', 'JobFactors', 'ResumeUpdate',
       'CurrencySymbol', 'CurrencyDesc', 'CompTotal', 'CompFreq',
       'ConvertedComp', 'WorkWeekHrs', 'WorkPlan', 'WorkChallenge',
       'WorkRemote', 'WorkLoc', 'ImpSyn', 'CodeRev', 'CodeRevHrs', 'UnitTests',
       'PurchaseHow', 'PurchaseWhat', 'LanguageWorkedWith',
       'LanguageDesireNextYear', 'DatabaseWorkedWith',
       'DatabaseDesireNextYear', 'PlatformWorkedWith',
       'PlatformDesireNextYear', 'WebFrameWorkedWith',
       'WebFrameDesireNextYear', 'MiscTechWorkedWith',
       'MiscTechDesireNextYear', 'DevEnviron', 'OpSys', 'Containers',
       'BlockchainOrg', 'BlockchainIs', 'BetterLife', 'ITperson', 'OffOn',
       'SocialMedia', 'Extraversion', 'ScreenName', 'SOVisit1st',
       'SOVisitFreq', 'SOVisitTo', 'SOFindAnswer', 'SOTimeSaved',
       'SOHowMuchTime', 'SOAccount', 'SOPartFreq', 'SOJobs', 'EntTeams',
       'SOComm', 'WelcomeChange', 'SONewContent', 'Age', 'Gender', 'Trans',
       'Sexuality', 'Ethnicity', 'Dependents', 'SurveyLength', 'SurveyEase'],
      dtype='object')

In [49]:
df['YearsCode'] # years of coding

Respondent
1          4
2        NaN
3          3
4          3
5         16
        ...
88377    NaN
88601    NaN
88802    NaN
88816    NaN
88863      8
Name: YearsCode, Length: 88883, dtype: object

In [51]:
df['YearsCode'] = df['YearsCode'].astype(float) # couldn't convert string 'Less than 1 year' to float error prompts

ValueError: could not convert string to float: 'Less than 1 year'

Now converting custom values to our own values
'Less than 1 Year' to 0 and 'ore than 50 years' to 51

In [52]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [60]:
df['YearsCode'].replace('Less than 1 year', 0, inplace = True) # replacing 'Less than 1 year' value to 0

In [64]:
df['YearsCode'].replace('More than 50 years', 51, inplace = True) # replacing 'More than 50 years' value to 51

In [62]:
df['YearsCode'].unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 0, '30', '9', '26', '40', '19', '15', '20', '28',
       '25', '1', '22', '11', '33', '50', '41', '18', '34', '24', '23',
       '42', '27', '21', '36', '32', '39', '38', '31', '37', 51, '29',
       '44', '45', '48', '46', '43', '47', '49'], dtype=object)

In [63]:
df['YearsCode'] = df['YearsCode'].astype(float)

In [65]:
df['YearsCode'].mean()

11.662114216834588

In [66]:
df['YearsCode'].median()

9.0